{
  "_name_or_path": "Salesforce/blip2-flan-t5-xxl",
  "architectures": [
    "Blip2ForConditionalGeneration"
  ],
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "is_encoder_decoder": true,
  "model_type": "blip-2",
  "num_query_tokens": 32,
  "qformer_config": {
    "classifier_dropout": null,
    "model_type": "blip_2_qformer"
  },
  "text_config": {
    "architectures": [
      "T5ForConditionalGeneration"
    ],
    "bos_token_id": 1,
    "classifier_dropout": 0.0,
    "d_ff": 10240,
    "d_kv": 64,
    "d_model": 4096,
    "decoder_start_token_id": 0,
    "dense_act_fn": "gelu",
    "dropout_rate": 0.1,
    "eos_token_id": 1,
    "feed_forward_proj": "gated-gelu",
    "initializer_factor": 1.0,
    "is_encoder_decoder": true,
    "is_gated_act": true,
    "layer_norm_epsilon": 1e-06,
    "model_type": "t5",
    "num_decoder_layers": 24,
    "num_heads": 64,
    "num_layers": 24,
    "output_past": true,
    "pad_token_id": 0,
    "relative_attention_max_distance": 128,
    "relative_attention_num_buckets": 32,
    "tie_word_embeddings": false,
    "torch_dtype": "float32",
    "vocab_size": 32128
  },
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "use_decoder_only_language_model": false,
  "vision_config": {
    "dropout": 0.0,
    "initializer_factor": 1.0,
    "model_type": "blip_2_vision_model",
    "num_channels": 3,
    "projection_dim": 512
  }
}
